## Staging: eventbridge
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 4 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                         NAME                          |
|--------|-------------------------------------------------------|
| add    | `aws_cloudwatch_event_rule.feedback_cronjob_schedule` |
|        | `aws_cloudwatch_event_target.ecs_target`              |
|        | `aws_iam_role.eventbridge_role`                       |
|        | `aws_iam_role_policy.eventbridge_policy`              |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.feedback_cronjob_schedule will be created
  + resource "aws_cloudwatch_event_rule" "feedback_cronjob_schedule" {
      + arn                 = (known after apply)
      + description         = "Trigger feedback cronjob every 10 minutes"
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "feedback-cronjob-schedule"
      + name_prefix         = (known after apply)
      + schedule_expression = "rate(10 minutes)"
      + tags                = {
          + "CostCentre" = "feedback-cronjob-staging"
        }
      + tags_all            = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_cloudwatch_event_target.ecs_target will be created
  + resource "aws_cloudwatch_event_target" "ecs_target" {
      + arn            = "arn:aws:ecs:ca-central-1:992382783569:cluster/feedback-cronjob-cluster"
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + role_arn       = (known after apply)
      + rule           = "feedback-cronjob-schedule"
      + target_id      = "feedback-cronjob-ecs-target"

      + ecs_target {
          + enable_ecs_managed_tags = false
          + enable_execute_command  = false
          + launch_type             = "FARGATE"
          + platform_version        = "LATEST"
          + task_count              = 1
          + task_definition_arn     = "arn:aws:ecs:ca-central-1:992382783569:task-definition/feedback-cronjob-task:1"

          + network_configuration {
              + assign_public_ip = false
              + security_groups  = [
                  + "sg-0d1a911fad1c21348",
                ]
              + subnets          = [
                  + "subnet-089ba77b72ba4e7ef",
                  + "subnet-08d75a1492fee6cbd",
                ]
            }
        }
    }

  # aws_iam_role.eventbridge_role will be created
  + resource "aws_iam_role" "eventbridge_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "events.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "feedback-cronjob-eventbridge-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "feedback-cronjob-staging"
        }
      + tags_all              = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy.eventbridge_policy will be created
  + resource "aws_iam_role_policy" "eventbridge_policy" {
      + id          = (known after apply)
      + name        = "feedback-cronjob-eventbridge-policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecs:RunTask",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ecs:ca-central-1:992382783569:task-definition/feedback-cronjob-task:1",
                          + "arn:aws:ecs:ca-central-1:992382783569:cluster/feedback-cronjob-cluster/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "iam:PassRole",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:iam::992382783569:role/feedback-cronjob-ecs-role",
                          + "arn:aws:iam::992382783569:role/feedback-cronjob-ecs-role",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + eventbridge_role_arn  = (known after apply)
  + eventbridge_rule_arn  = (known after apply)
  + eventbridge_rule_name = "feedback-cronjob-schedule"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.feedback_cronjob_schedule"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.eventbridge_role"]

21 tests, 19 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
